export const standardHiragana = [
  "あ", "い", "う", "え", "お",
  "か", "き", "く", "け", "こ",
  "さ", "し", "す", "せ", "そ",
  "た", "ち", "つ", "て", "と",
  "な", "に", "ぬ", "ね", "の",
  "は", "ひ", "ふ", "へ", "ほ",
  "ま", "み", "む", "め", "も",
  "や",      "ゆ",      "よ",
  "ら", "り", "る", "れ", "ろ",
  "わ",                "を",
  "ん",
];
export const standardKatakana = [
  "ア", "イ", "ウ", "エ", "オ",
  "カ", "キ", "ク", "ケ", "コ",
  "サ", "シ", "ス", "セ", "ソ",
  "タ", "チ", "ツ", "テ", "ト",
  "ナ", "ニ", "ヌ", "ネ", "ノ",
  "ハ", "ヒ", "フ", "ヘ", "ホ",
  "マ", "ミ", "ム", "メ", "モ",
  "ヤ",      "ユ",      "ヨ",
  "ラ", "リ", "ル", "レ", "ロ",
  "ワ",                "ヲ",
  "ン",
];
export const standardRomaji = [
  "a",  "i",   "u",   "e",  "o",
  "ka", "ki",  "ku",  "ke", "ko",
  "sa", "shi", "su",  "se", "so",
  "ta", "chi", "tsu", "te", "to",
  "na", "ni",  "nu",  "ne", "no",
  "ha", "hi",  "fu",  "he", "ho",
  "ma", "mi",  "mu",  "me", "mo",
  "ya",        "yu",        "yo",
  "ra", "ri",  "ru",  "re", "ro",
  "wa",                     "wo",
  "n",
];

export const dakuonHiragana = [
  "が", "ぎ", "ぐ", "げ", "ご",
  "ざ", "じ", "ず", "ぜ", "ぞ",
  "だ", "ぢ", "づ", "で", "ど",
  "ば", "び", "ぶ", "べ", "ぼ",
  "ぱ", "ぴ", "ぷ", "ぺ", "ぽ",
];
export const dakuonKatakana = [
  "ガ", "ギ", "グ", "ゲ", "ゴ",
  "ザ", "ジ", "ズ", "ゼ", "ゾ",
  "ダ", "ヂ", "ヅ", "デ", "ド",
  "バ", "ビ", "ブ", "ベ", "ボ",
  "パ", "ピ", "プ", "ペ", "ポ",
];
export const dakuonRomaji = [
  "ga", "gi", "gu", "ge", "go",
  "za", "ji", "zu", "ze", "zo",
  "da", "ji", "zu", "de", "do",
  "ba", "bi", "bu", "be", "bo",
  "pa", "pi", "pu", "pe", "po",
];

export const comboHiragana = [
  "きゃ", "きゅ", "きょ",
  "ぎゃ", "ぎゅ", "ぎょ",
  "しゃ", "しゅ", "しょ",
  "じゃ", "じゅ", "じょ",
  "ちゃ", "ちゅ", "ちょ",
  "にゃ", "にゅ", "にょ",
  "ひゃ", "ひゅ", "ひょ",
  "びゃ", "びゅ", "びょ",
  "ぴゃ", "ぴゅ", "ぴょ",
  "みゃ", "みゅ", "みょ",
  "りゃ", "りゅ", "りょ",
];
export const comboKatakana = [
  "キャ", "キュ", "キョ",
  "ギャ", "ギュ", "ギョ",
  "シャ", "シュ", "ショ",
  "ジャ", "ジュ", "ジョ",
  "チャ", "チュ", "チョ",
  "ニャ", "ニュ", "ニョ",
  "ヒャ", "ヒュ", "ヒョ",
  "ビャ", "ビュ", "ビョ",
  "ピャ", "ピュ", "ピョ",
  "ミャ", "ミュ", "ミョ",
  "リャ", "リュ", "リョ",
];
export const comboRomaji = [
  "kya", "kyu", "kyo",
  "gya", "gyu", "gyo",
  "sha", "shu", "sho",
  "ja",  "ju",  "jo",
  "cha", "chu", "cho",
  "nya", "nyu", "nyo",
  "hya", "hyu", "hyo",
  "bya", "byu", "byo",
  "pya", "pyu", "pyo",
  "mya", "myu", "myo",
  "rya", "ryu", "ryo",
];
